tests/src/serviceTest/resources/request/consultationDroits/v3/24_sansEffet_request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://ws.cegedimassurance.com/basededroit/wsdl" xmlns:base="http://norme.cegedimassurances.com/base_de_droit" xmlns:com="http://norme.cegedimassurances.com/commun" xmlns:ben="http://norme.cegedimassurances.com/beneficiaire" xmlns:amc="http://norme.cegedimassurances.com/amc">

    <soap:Body>
        <wsdl:getInfoBddRequest>
            <base:header_in>
                <com:headerTech>
                    <com:id_logiciel_client>ALLIANCE PREMIUM</com:id_logiciel_client>
                    <com:version_logiciel_client>V201_15_07</com:version_logiciel_client>
                    <com:id_session_client>136415</com:id_session_client>
                </com:headerTech>
                <com:headerFonc>
                    <com:code_contexte>CD-01</com:code_contexte>
                    <com:delivrance_accreditation>1</com:delivrance_accreditation>
                    <com:code_proprietaire>0060005615</com:code_proprietaire>
                </com:headerFonc>
            </base:header_in>
            <base:beneficiaire>
                <ben:NIR_certifie>1234567890123</ben:NIR_certifie>
                <ben:cle_NIR>99</ben:cle_NIR>
                <ben:date_naissance>19990909</ben:date_naissance>
                <ben:rang_gemellaire>1</ben:rang_gemellaire>
            </base:beneficiaire>
            <base:amc>
                <amc:nom>TNR</amc:nom>
                <amc:adherent></amc:adherent>
                <amc:numero_AMC_prefectoral>0000401471</amc:numero_AMC_prefectoral>
            </base:amc>
            <base:info_bdd>
                <base:type_recherche_benef>0</base:type_recherche_benef>
                <base:type_recherche_segment>3</base:type_recherche_segment>
                <base:liste_segment_recherche>
                    <base:segment_recherche>AUDI</base:segment_recherche>
                </base:liste_segment_recherche>
                <base:type_profondeur_recherche>0</base:type_profondeur_recherche>
            </base:info_bdd>
            <base:dates>
                <com:date_reference>2022-12-01</com:date_reference>
                <com:type_date_reference>1</com:type_date_reference>
            </base:dates>
        </wsdl:getInfoBddRequest>
    </soap:Body>
</soap:Envelope>
